# ExternalDataTypeServerFailureResolutionExecutingEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataTypeServerFailureResolutionExecutingEventArgs Class
Members See Also
---
The event arguments used by the ExternalDataTypeServerFailureResolutionExecuting event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class ExternalDataTypeServerFailureResolutionExecutingEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class ExternalDataTypeServerFailureResolutionExecutingEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class ExternalDataTypeServerFailureResolutionExecutingEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.DB.Events..::..ExternalDataTypeServerFailureResolutionExecutingEventArgs
# See Also
ExternalDataTypeServerFailureResolutionExecutingEventArgs Members
Autodesk.Revit.DB.Events Namespace